
<template>
  <div class="abstract">
    <titleCom style="margin-bottom:2vw" title="公司简介"/>
    <span class="content">
      陕西旭莱环保科技有限公司是为仲裁机构提供互联网仲裁服务的科技公司。自创立以来，一直致力于互联网仲裁产品与服务的持续创新，和仲裁理论与实务领域相关问题的研究。
作为一家法律与技术相结合的公司，旭莱在互联网仲裁的技术应用等领域，积累了丰富的设计、开发、应用、维护与拓展等实践经验，利用互联网大数据和区块链等技术，为仲裁机构打造仲裁服务争议解决平台，建立了专业、高效的互联网仲裁服务团队。通过深入挖掘仲裁机构案件办理等工作当中的需求，为仲裁机构打造保障安全、程序合法、高效便捷、成本适中、开放强大的互联网仲裁系统。实现了从立案、受理、审理到裁决、送达等仲裁全部或主要程序在线化、数字化与仲裁程序保障的安全性、稳定性相结合。
旭莱以科技为依托，为仲裁机构提供互联网仲裁技术服务，极大程度提高了仲裁效率。未来，旭莱将充分发挥自身在互联网仲裁产品与服务领域的优势，不断开拓案件办理过程中的技术服务应用场景，用科技创新为更多仲裁参与者提供更加智能、便捷、安全、高效的互联网仲裁技术服务，促进国内外对互联网仲裁的认知与应用，推动互联网仲裁持续发展。
    </span><br/><br/>
    <span>
      在学术研发层面，旭莱还与中国仲裁法学研究会，中国社会科学院法学研究所，上海社会科学院，以及知名法学院等多家学术机构建立了深度合作，为互联网仲裁技术研发打下了坚实的理论基础。旭莱期待与更多的仲裁机构合作，助力仲裁事业更加智能、便捷、安全、高效的发展。
    </span>
  </div>
</template>

<script>
import titleCom from '@/components/titleCom/titleCom'
export default {
  name: "abstract",
  components:{
    titleCom
  },
  data() {
    return {
    };
  }
};
</script>

<style lang="less" scoped>
.abstract{
  width:80vw;
  margin: 0px auto;
  padding:2.8vw;
  span {
    font-size: 16px;
    line-height: 30px;
  }
}

</style>
