
<template>
  <div class="activity">
    <div v-if="activeData.length">
      <activityItem v-for="item in activeData" :key="item.id" :activeItem="item" />
    </div>
    <div class="none" v-else>
      <img :src="noneImg" alt />
      <p>未找到数据</p>
    </div>
  </div>
</template>

<script>
import { mapActions } from 'vuex'
import activityItem from './children/activityItem'
import activeItem from "@/assets/images/activeItem.jpg";
import noneImg from "@/assets/images/none.jpg";
export default {
  name: "activity",
  components:{
    activityItem
  },
  data() {
    return {
      noneImg:noneImg,
      activeData:[
        {
          id:"1",
          title:'活动预告',
          listData:[
            {
              id:'1',
              imgSrc:activeItem,
              title:"仲裁大家谈—尤科斯案给中国企业和仲裁界的启示",
              content:"尤科斯石油公司（以下称“尤科斯公司”）是俄罗斯最大的石油和天然气公司之一，主要是从事石油、天然气和石化产品的勘探、生产、提炼和销售业务。自2003年起，尤科斯公司被俄罗斯政府部门认定存在逃税、欺诈等行为，需缴纳总额超过100亿美元的罚款。尤科斯公司在俄罗斯国内寻求了多种救济，但诉求都被驳回。由于未能如期履行法院判决，尤科斯公司的部分子公司被查封或强制拍卖，但仍有大量债务无法偿还，尤科斯公司最终于2007年11月被注销。此外，尤科斯公司大股东也被判处了刑事处罚，并要求其缴纳尤科斯公司以及其个人未交的税款。除了在俄罗斯国内寻求救济措施之外，尤科斯公司在俄罗斯外也采取多线申诉，霍多尔科夫斯基等尤科斯公司股东在欧洲人权法院起诉，尤科斯公司的三家股东在海牙常设仲裁院(后称PCA)申请仲裁，Quasar（一家拥有尤科斯公司存托凭证的西班牙公司）向斯德哥尔摩商事仲裁院提出仲裁……"
            },
            {
              id:'2',
              imgSrc:activeItem,
              title:"仲裁实务与理论-如何挑选仲裁员",
              content:"仲裁程序一旦开始，接着的任务就是选到合适的仲裁员——案件输赢的裁判。 紧接着关于《仲裁申请书》的两次在线讲座，陈建博士的仲裁实务与理论系列课程，就到了挑选仲裁员的环节。结合多年处理仲裁案件的经验，对挑选仲裁员的时候需要留意的林林总总，陈老师一一道来、分享……"
            },
            {
              id:'3',
              imgSrc:activeItem,
              title:"仲裁大家谈—尤科斯案给中国企业和仲裁界的启示",
              content:"尤科斯石油公司（以下称“尤科斯公司”）是俄罗斯最大的石油和天然气公司之一，主要是从事石油、天然气和石化产品的勘探、生产、提炼和销售业务。自2003年起，尤科斯公司被俄罗斯政府部门认定存在逃税、欺诈等行为，需缴纳总额超过100亿美元的罚款。尤科斯公司在俄罗斯国内寻求了多种救济，但诉求都被驳回。由于未能如期履行法院判决，尤科斯公司的部分子公司被查封或强制拍卖，但仍有大量债务无法偿还，尤科斯公司最终于2007年11月被注销。此外，尤科斯公司大股东也被判处了刑事处罚，并要求其缴纳尤科斯公司以及其个人未交的税款。除了在俄罗斯国内寻求救济措施之外，尤科斯公司在俄罗斯外也采取多线申诉，霍多尔科夫斯基等尤科斯公司股东在欧洲人权法院起诉，尤科斯公司的三家股东在海牙常设仲裁院(后称PCA)申请仲裁，Quasar（一家拥有尤科斯公司存托凭证的西班牙公司）向斯德哥尔摩商事仲裁院提出仲裁……"
            },
          ]
        },
        {id:"2",title:'学术分享',          listData:[
            {
              id:'1',
              imgSrc:activeItem,
              title:"仲裁大家谈—尤科斯案给中国企业和仲裁界的启示",
              content:"尤科斯石油公司（以下称“尤科斯公司”）是俄罗斯最大的石油和天然气公司之一，主要是从事石油、天然气和石化产品的勘探、生产、提炼和销售业务。自2003年起，尤科斯公司被俄罗斯政府部门认定存在逃税、欺诈等行为，需缴纳总额超过100亿美元的罚款。尤科斯公司在俄罗斯国内寻求了多种救济，但诉求都被驳回。由于未能如期履行法院判决，尤科斯公司的部分子公司被查封或强制拍卖，但仍有大量债务无法偿还，尤科斯公司最终于2007年11月被注销。此外，尤科斯公司大股东也被判处了刑事处罚，并要求其缴纳尤科斯公司以及其个人未交的税款。除了在俄罗斯国内寻求救济措施之外，尤科斯公司在俄罗斯外也采取多线申诉，霍多尔科夫斯基等尤科斯公司股东在欧洲人权法院起诉，尤科斯公司的三家股东在海牙常设仲裁院(后称PCA)申请仲裁，Quasar（一家拥有尤科斯公司存托凭证的西班牙公司）向斯德哥尔摩商事仲裁院提出仲裁……"
            },
            {
              id:'2',
              imgSrc:activeItem,
              title:"仲裁实务与理论-如何挑选仲裁员",
              content:"仲裁程序一旦开始，接着的任务就是选到合适的仲裁员——案件输赢的裁判。 紧接着关于《仲裁申请书》的两次在线讲座，陈建博士的仲裁实务与理论系列课程，就到了挑选仲裁员的环节。结合多年处理仲裁案件的经验，对挑选仲裁员的时候需要留意的林林总总，陈老师一一道来、分享……"
            },
            {
              id:'3',
              imgSrc:activeItem,
              title:"仲裁大家谈—尤科斯案给中国企业和仲裁界的启示",
              content:"尤科斯石油公司（以下称“尤科斯公司”）是俄罗斯最大的石油和天然气公司之一，主要是从事石油、天然气和石化产品的勘探、生产、提炼和销售业务。自2003年起，尤科斯公司被俄罗斯政府部门认定存在逃税、欺诈等行为，需缴纳总额超过100亿美元的罚款。尤科斯公司在俄罗斯国内寻求了多种救济，但诉求都被驳回。由于未能如期履行法院判决，尤科斯公司的部分子公司被查封或强制拍卖，但仍有大量债务无法偿还，尤科斯公司最终于2007年11月被注销。此外，尤科斯公司大股东也被判处了刑事处罚，并要求其缴纳尤科斯公司以及其个人未交的税款。除了在俄罗斯国内寻求救济措施之外，尤科斯公司在俄罗斯外也采取多线申诉，霍多尔科夫斯基等尤科斯公司股东在欧洲人权法院起诉，尤科斯公司的三家股东在海牙常设仲裁院(后称PCA)申请仲裁，Quasar（一家拥有尤科斯公司存托凭证的西班牙公司）向斯德哥尔摩商事仲裁院提出仲裁……"
            },
          ]},
        {id:"3",title:'活动回顾',          listData:[
            {
              id:'1',
              imgSrc:activeItem,
              title:"仲裁大家谈—尤科斯案给中国企业和仲裁界的启示",
              content:"尤科斯石油公司（以下称“尤科斯公司”）是俄罗斯最大的石油和天然气公司之一，主要是从事石油、天然气和石化产品的勘探、生产、提炼和销售业务。自2003年起，尤科斯公司被俄罗斯政府部门认定存在逃税、欺诈等行为，需缴纳总额超过100亿美元的罚款。尤科斯公司在俄罗斯国内寻求了多种救济，但诉求都被驳回。由于未能如期履行法院判决，尤科斯公司的部分子公司被查封或强制拍卖，但仍有大量债务无法偿还，尤科斯公司最终于2007年11月被注销。此外，尤科斯公司大股东也被判处了刑事处罚，并要求其缴纳尤科斯公司以及其个人未交的税款。除了在俄罗斯国内寻求救济措施之外，尤科斯公司在俄罗斯外也采取多线申诉，霍多尔科夫斯基等尤科斯公司股东在欧洲人权法院起诉，尤科斯公司的三家股东在海牙常设仲裁院(后称PCA)申请仲裁，Quasar（一家拥有尤科斯公司存托凭证的西班牙公司）向斯德哥尔摩商事仲裁院提出仲裁……"
            },
            {
              id:'2',
              imgSrc:activeItem,
              title:"仲裁实务与理论-如何挑选仲裁员",
              content:"仲裁程序一旦开始，接着的任务就是选到合适的仲裁员——案件输赢的裁判。 紧接着关于《仲裁申请书》的两次在线讲座，陈建博士的仲裁实务与理论系列课程，就到了挑选仲裁员的环节。结合多年处理仲裁案件的经验，对挑选仲裁员的时候需要留意的林林总总，陈老师一一道来、分享……"
            },
            {
              id:'3',
              imgSrc:activeItem,
              title:"仲裁大家谈—尤科斯案给中国企业和仲裁界的启示",
              content:"尤科斯石油公司（以下称“尤科斯公司”）是俄罗斯最大的石油和天然气公司之一，主要是从事石油、天然气和石化产品的勘探、生产、提炼和销售业务。自2003年起，尤科斯公司被俄罗斯政府部门认定存在逃税、欺诈等行为，需缴纳总额超过100亿美元的罚款。尤科斯公司在俄罗斯国内寻求了多种救济，但诉求都被驳回。由于未能如期履行法院判决，尤科斯公司的部分子公司被查封或强制拍卖，但仍有大量债务无法偿还，尤科斯公司最终于2007年11月被注销。此外，尤科斯公司大股东也被判处了刑事处罚，并要求其缴纳尤科斯公司以及其个人未交的税款。除了在俄罗斯国内寻求救济措施之外，尤科斯公司在俄罗斯外也采取多线申诉，霍多尔科夫斯基等尤科斯公司股东在欧洲人权法院起诉，尤科斯公司的三家股东在海牙常设仲裁院(后称PCA)申请仲裁，Quasar（一家拥有尤科斯公司存托凭证的西班牙公司）向斯德哥尔摩商事仲裁院提出仲裁……"
            },
          ]}
      ]
    };
  },
  methods:{
    ...mapActions(['getActive']),
    async getData(){
      let params = { type: 1 };
      let result = await this.getActive(params);
      if(result.flag){
        this.$Spin.hide();
        this.activeData = result.data
        // this.activeData.forEach(item=>{
        //   if(item.extraContentInfos){
        //     item.extraContentInfos.sort((a,b) => a.sort-b.sort)
        //   } 
        // })
      }
    }
  },
  mounted(){
    this.$Spin.show({
      render: (h) => {
          return h('div', [
              h('Icon', {
                  'class': 'demo-spin-icon-load',
                  props: {
                      type: 'ios-loading',
                      size: 18
                  }
              }),
              h('div', 'Loading')
          ])
        }
    });
    this.getData()
    this.$store.commit('setType','旭莱活动')
  },
};
</script>

<style lang="less" scoped>
.activity {
  .none {
    display: flex;
    flex-direction: column;
    align-items: center;
    width: 79.2vw;
    height: 600px;
    margin: 0 auto;
    img {
      margin-top: 100px;
    }
    p {
      text-align: center;
      font-size: 20px;
      font-weight: 600;
      margin-top: 50px;
    }
  }
}
</style>
